{
    "skills": [
        {
            "title": "Réaliser",
            "icon": "fa-code",
            "description": [
                "Objectif : être capable de développer un outil informatique qui répond à un besoin client.",
                "Etapes : conception du produit, code, tests, déploiement / intégration, maintenance, documentation."
            ],
            "levels": [
                {
                    "name": "Développer des applications informatiques simples",
                    "info": "Concevoir et développer des interfaces simples d'utilisation au vu des spécifications fournies"
                },
                {
                    "name": "Partir des exigences et aller jusqu'à une application complète",
                    "info": "Développer des applications accessibles, ergonomiques et robustes (à l'aide de tests) au vu des spécifications définies à partir du besoin du client"
                },
                {
                    "name": "Adapter des applications sur un ensemble de supports",
                    "info": "Choisir les bonnes technologies, intégrer des applications dans des environnements de production et savoir les maintenir en état"
                }
            ],
            "professional_situations": ["Élaboration d'une une application informatique", "Évolution des applications", "Maintenance d'une application informatique en conditions opérationnelles"],
            "personal_review": {
                "level": 3,
                "explanation": "Je suis capable de sélectionner une technologie adéquate en fonction des spécifications et de réaliser une solution informatique complète. J'ai eu l'occasion d'en maintenir, voire d'en améliorer certaines."
            }
        },
        {
            "title": "Optimiser",
            "icon": "fa-chart-area",
            "description": [
                "Objectif : être capable de proposer la meilleure solution à un problème informatique en fonction de critères spécifiques.",
                "Il est nécessaire d'analyser un problème informatique et de proposer des méthodes de résolution, de savoir les comparer, et de sélectionner les structures de données et/ou algorithmes adéquats."
            ],
            "levels": [
                {
                    "name": "Appréhender et construire des algorithmes",
                    "info": "Comparer des algorithmes et choisir le meilleur, à l'aide des outils mathématiques à disposition (arbres, graphes...)"
                },
                {
                    "name": "Sélectionner les algorithmes adéquats pour répondre à un problème donné",
                    "info": "Par souci de sécurité et d'impact, savoir utiliser des techniques algorithmiques avancées au besoin (optimisation, IA, hachage...)"
                },
                {
                    "name": "Analyser et optimiser des applications",
                    "info": "Améliorer un code existant après analyse de son comportement, remplacer des technologies si nécessaire pour améliorer son fonctionnement"
                }
            ],
            "professional_situations": ["Améliorer les performances des programmes dans des contextes contraints", "Limiter l'impact environnemental d'une application informatique", "Mettre en place des applications informatiques adaptées et efficaces"],
            "personal_review": {
                "level": 3,
                "explanation": "Je sais évaluer différentes solutions et sélectionner la meilleure (et celle qui permet de consommer le moins possible en termes de ressources et d'énergie). J'ai également eu l'occasion d'analyser un code existant pour l'améliorer."
            }
        },
        {
            "title": "Administrer",
            "icon": "fa-terminal",
            "description": [
                "Objectif : être en capacité d'installer, de configurer et de déployer des services réseaux afin d'optimiser le système informatique de structures ou d'organisation.",
                "Etapes : connaissance du fonctionnement des protocoles de base, prise de recul sur les besoins du client pour estimer la taille du réseau à déployer, le choix des structures, ainsi que leur maintenabilité."
            ],
            "levels": [
                {
                    "name": "Installer et configurer un poste de travail",
                    "info": "Connaître et identifier les différents composants d'un système, savoir les manipuler, configurer un système d'exploitation"
                },
                {
                    "name": "Déployer des services dans une architecture réseau",
                    "info": "Savoir utiliser des serveurs, relier des applications par ces services et les sécuriser"
                }
            ],
            "professional_situations": ["Déployer une nouvelle architecture technique", "Améliorer une infrastructure existante", "Sécuriser les applications et les services"],
            "personal_review": {
                "level": 2,
                "explanation": "Je suis en capacité de déployer des serveurs web Apache sous Linux, et de créer des liaisons TCP et UDP."
            }
        },
        {
            "title": "Gérer",
            "icon": "fa-database",
            "description": [
                "Objectif : savoir analyser et exploiter les données d'une structure.",
                "Il est possible de les entretenir et de concevoir une base ou un agencement optimal comme il est possible de les analyser pour en tirer une conclusion, souvent stratégique.",
                "Assurer la sécurité, la cohérence et l'intégrité des données est indispensable."
            ],
            "levels": [
                {
                    "name": "Concevoir et mettre en place une base de données à partir d'un cahier des charges client",
                    "info": "Savoir concevoir des bases de données relationnelles, mais également les interroger, et en tirer des données"
                },
                {
                    "name": "Optimiser une base de données, interagir avec une application et mettre en oeuvre la sécurité",
                    "info": "Analyser des données et améliorer leur flux via les bases les contenants, aussi hétérogènes les données soient-elles"
                }
            ],
            "professional_situations": ["Lancer un nouveau projet", "Sécuriser des données", "Exploiter des données pour la prise de décisions"],
            "personal_review": {
                "level": 2,
                "explanation": "Je peux exploiter des bases de données relationnelles et non-relationnelles, et les analyser à l'aide de tableaux de reporting simples."
            }
        },
        {
            "title": "Conduire",
            "icon": "fa-person-chalkboard",
            "description": [
                "Objectif : savoir utiliser les outils de gestion de projet informatique (méthodes classiques, agiles, tableaux de bord...) pour satisfaire au mieux les besoins des utilisateurs.",
                "Savoir adopter les bonnes démarches, une bonne politique de communication, et respecter les règles juridiques et éthique est crucial."
            ],
            "levels": [
                {
                    "name": "Identifier les besoins métiers des clients et des utilisateurs",
                    "info": "Appréhender les besoins, mettre en place les outils nécessaires et savoir identifier les acteurs du projet"
                },
                {
                    "name": "Appliquer une démarche de suivi de projet en fonction des besoins métiers des clients et des utilisateurs",
                    "info": "Analyser les processus d'une organisation pour améliorer son système d'information, et être capable de suivre des projets"
                }
            ],
            "professional_situations": ["Lancer un nouveau projet", "Piloter le maintien d'un projet en condition opérationnelle", "Faire évoluer un système d'information"],
            "personal_review": {
                "level": 2,
                "explanation": "Je peux planifier (Gantt, RACI, PERT méthodes de découpage) et suivre (tableau de bord) un projet à toutes ses phases, en utilisant les méthodes agiles ou non."
            }
        },
        {
            "title": "Collaborer",
            "icon": "fa-user-group",
            "description": [
                "Objectif : apprendre à travailler de manière efficace dans une équipe informatique.",
                "La communication est un facteur clé. Les informations doivent être partagées et accessibles."
            ],
            "levels": [
                {
                    "name": "Identifier ses aptitudes pour travailler dans une équipe",
                    "info": "Découvrir les aptitudes requises dans le monde de l'informatique et savoir s'y identifier, et acquérir les compétences manquantes, ainsi que des compétences interpersonnelles"
                },
                {
                    "name": "Situer son rôle et ses missions au sein d'une équipe informatique",
                    "info": "Analyser la place de l'informatique dans le monde du travail et vivre des expériences dans une équipe informatique"
                },
                {
                    "name": "Manager une équipe informatique",
                    "info": "Guider la transition numérique au seun d'une organisation, gérer les projets informatiques selon des enjeux d'innovation"
                }
            ],
            "professional_situations": ["Lancer un nouveau projet", "Organiser son travail en relation avec celui de son équipe", "Elaborer, gérer et transmettre de l'information"],
            "personal_review": {
                "level": 3,
                "explanation": "Je sais gérer une équipe pour un projet donné et comprends les objectifs à atteindre. J'utilise mes soft skills pour communiquer et j'intègre rapidement divers milieux."
            }
        }
    ]
}